app/Http/Controllers/LibroController.php

    public function index(Request $request)
    {
        $titulo = $request->get('titulo');
        $sinopsis = $request->get('sinopsis');
        $pvp = $request->get('pvp');

        $libros = Libro::orderBy('id')
            ->titulo($titulo)
            ->sinopsis($sinopsis)
            ->pvp($pvp)
            ->paginate(5);
---
select * from `libros` where `titulo` like '%a%' and `sinopsis` like '%%' and `pvp` >= 10 and `pvp` <= '50' order by `id` asc limit 5 offset 0
select count(*) as aggregate from `libros` where `titulo` like '%a%' and `sinopsis` like '%%' and `pvp` >= 10 and `pvp` <= '50'